tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "armmbed/formulae"
tap "chipsalliance/verible"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "hookdeck/hookdeck"
tap "microsoft/git"
tap "randomplum/gtkwave"
brew "glib"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "awscli"
brew "certbot"
brew "chezmoi"
brew "clang-format"
brew "cmake"
brew "cowsay"
brew "curl"
brew "eza"
brew "gnutls"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "librist"
brew "tesseract"
brew "ffmpeg"
brew "python@3.11"
brew "fontforge", link: false
brew "fzf"
brew "gd"
brew "gh"
brew "ghostscript"
brew "git"
brew "glew"
brew "glfw"
brew "glib-networking"
brew "libusb"
brew "gnupg"
brew "netpbm"
brew "gts"
brew "graphviz"
brew "gtk+3"
brew "gtk4"
brew "handbrake"
brew "hashcat"
brew "htop"
brew "hugo"
brew "icarus-verilog"
brew "iftop"
brew "libheif"
brew "imagemagick"
brew "libpcap"
brew "libpsl"
brew "libsoup"
brew "llvm"
brew "mas"
brew "minicom"
brew "monolith"
brew "nmap"
brew "node"
brew "openfpgaloader"
brew "openjdk@11"
brew "pdf2svg"
brew "perl@5.18"
brew "php"
brew "pnpm"
brew "poetry"
brew "postgresql@14"
brew "py3cairo"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pygobject3"
brew "qt@5"
brew "pyqt@5"
brew "python@3.10"
brew "rclone"
brew "redis", restart_service: true
brew "rsync"
brew "ruby@2.7", link: true
brew "rustup"
brew "scrcpy"
brew "siril"
brew "socat"
brew "sox"
brew "telnet"
brew "tldr"
brew "tmux"
brew "trash", link: true
brew "usbutils"
brew "vcpkg"
brew "verilator"
brew "virtualenv"
brew "wget"
brew "wireguard-tools"
brew "yt-dlp"
brew "zoxide"
brew "armmbed/formulae/arm-none-eabi-gcc"
brew "chipsalliance/verible/verible"
brew "hookdeck/hookdeck/hookdeck"
brew "randomplum/gtkwave/gtkwave", args: ["HEAD"]
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "airbuddy"
cask "arduino"
cask "arduino-ide"
cask "authy"
cask "balenaetcher"
cask "bartender"
cask "beeper"
cask "blender"
cask "brave-browser"
cask "cleanshot"
cask "clion"
cask "clop"
cask "commander-one"
cask "cyberduck"
cask "daisydisk"
cask "dash"
cask "db-browser-for-sqlite"
cask "detexify"
cask "devutils"
cask "disk-drill"
cask "element"
cask "fig"
cask "firefox"
cask "fontforge"
cask "freecad"
cask "git-credential-manager"
cask "git-credential-manager"
cask "gitkraken"
cask "google-chrome"
cask "handbrake"
cask "hex-fiend"
cask "idrive"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "keyboardcleantool"
cask "klayout"
cask "linearmouse"
cask "little-snitch"
cask "ltspice"
cask "lunar"
cask "mactex-no-gui"
cask "mattermost"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "mimestream"
cask "netspot"
cask "network-radar"
cask "notchnook"
cask "notion-calendar"
cask "nova"
cask "nvidia-geforce-now"
cask "obs"
cask "orbstack"
cask "paragon-ntfs"
cask "parallels"
cask "parsec"
cask "pdf-expert"
cask "preform"
cask "private-internet-access"
cask "qlmarkdown"
cask "qlvideo"
cask "quarto"
cask "rapidapi"
cask "raycast"
cask "scansion"
cask "segger-embedded-studio-for-arm"
cask "sensei"
cask "sf-symbols"
cask "signal"
cask "slack"
cask "soulver"
cask "spotify"
cask "steam"
cask "superlist"
cask "syncthing"
cask "syntax-highlight"
cask "tailscale"
cask "tempbox"
cask "termius"
cask "tor-browser"
cask "transmission"
cask "ultimaker-cura"
cask "unite"
cask "viscosity"
cask "visual-studio-code"
cask "whatsapp"
cask "whisky"
cask "wifi-explorer"
cask "wireshark"
cask "zed"
cask "zoom"
cask "zotero"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Cardhop", id: 1290358394
mas "DaVinci Resolve", id: 571213070
mas "Developer", id: 640199958
mas "DuckDuckGo", id: 663592361
mas "Encrypto", id: 935235287
mas "Grammarly for Safari", id: 1462114288
mas "Hand Mirror", id: 1502839586
mas "Keynote", id: 409183694
mas "Lunacy", id: 1582493835
mas "Nautomate", id: 1608529689
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "PastePal", id: 1503446680
mas "PayPal Honey", id: 1472777122
mas "PDF Search", id: 1229271394
mas "Playlisty for Apple Music", id: 1459275972
mas "rcmd", id: 1596283165
mas "Sequel Ace", id: 1518036000
mas "Shazam", id: 897118787
mas "Spark Desktop", id: 6445813049
mas "TestFlight", id: 899247664
mas "Userscripts-Mac-App", id: 1463298887
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "affenwiesel.matlab-formatter"
vscode "alexcvzz.vscode-sqlite"
vscode "asciidoctor.asciidoctor-vscode"
vscode "astro-build.astro-vscode"
vscode "bluebrown.yamlfmt"
vscode "bramvanbilsen.matlab-code-run"
vscode "christian-kohler.npm-intellisense"
vscode "dan-c-underwood.arm"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "doublebuffer.metal-shader"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hmccsbw.hmmm"
vscode "james-yu.latex-workshop"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mathworks.language-matlab"
vscode "mechatroner.rainbow-csv"
vscode "mkvoya.eps-preview"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "mshr-h.veriloghdl"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "quarto.quarto"
vscode "raylabz.act"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "semanticdiff.semanticdiff"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shinyypig.matlab-in-vscode"
vscode "sswg.swift-lang"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tcwalther.cython"
vscode "tecosaur.latex-utilities"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "xaver.clang-format"
