tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "armmbed/formulae"
tap "chipsalliance/verible"
tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/services"
tap "hookdeck/hookdeck"
tap "microsoft/git"
tap "randomplum/gtkwave"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Core application library for C
brew "glib"
# OpenType text shaping engine
brew "harfbuzz"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern, maintained replacement for ls
brew "eza"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-line outline and bitmap font editor/converter
brew "fontforge", link: false
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Improved top (interactive process viewer)
brew "htop"
# Verilog simulation and synthesis tool
brew "icarus-verilog"
# Library for USB device access
brew "libusb"
# Mac App Store command-line interface
brew "mas"
# Port scanning utility for large networks
brew "nmap"
# Universal utility for programming FPGA
brew "openfpgaloader"
# General-purpose scripting language
brew "php"
# Fast, disk space efficient package manager
brew "pnpm"
# Python package management tool
brew "poetry"
# Object-relational database system
brew "postgresql@14"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Cross-platform application and UI framework
brew "qt@5"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Rsync for cloud storage
brew "rclone"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Utility that provides fast incremental file transfer
brew "rsync"
# Rust toolchain installer
brew "rustup"
# SOcket CAT: netcat on steroids
brew "socat"
# SOund eXchange: universal sound sample translator
brew "sox"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# List detailed info about USB devices
brew "usbutils"
# C++ Library Manager
brew "vcpkg"
# Verilog simulator
brew "verilator"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
brew "armmbed/formulae/arm-none-eabi-gcc"
# SystemVerilog developer tools
brew "chipsalliance/verible/verible"
# Hookdeck CLI utility
brew "hookdeck/hookdeck/hookdeck"
# GTKWave
brew "randomplum/gtkwave/gtkwave", args: ["HEAD"]
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# AirPods companion app
cask "airbuddy"
# Chromium based browser
cask "arc"
# Menu bar icon organiser
cask "bartender"
# Universal chat app powered by Matrix
cask "beeper"
# Screen capturing tool
cask "cleanshot"
# Image, video and clipboard optimiser
cask "clop"
# Track and budget money
cask "copilot"
# Disk space visualiser
cask "daisydisk"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# LaTeX handwritten symbol recognition
cask "detexify"
# All-in-one toolbox for developers
cask "devutils"
# Voice and text chat software
cask "discord"
# Data recovery software
cask "disk-drill"
cask "font-meslo-lg-nerd-font"
cask "font-sauce-code-pro-nerd-font"
# Font editor and converter for outline and bitmap fonts
cask "fontforge"
# 3D parametric modeller
cask "freecad"
# Git client focusing on productivity
cask "gitkraken"
# Open-source video transcoder
cask "handbrake"
# Cloud backup and storage solution
cask "idrive"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# IC design layout viewer and editor
cask "klayout"
# Customise mouse behavior
cask "linearmouse"
# Host-based application firewall
cask "little-snitch"
# SPICE simulation software, schematic capture and waveform viewer
cask "ltspice"
# Adaptive brightness for external displays
cask "lunar"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Open-source, self-hosted Slack-alternative
cask "mattermost"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# WiFi site survey software and WiFi scanner
cask "netspot"
# Tool to scan and monitor the network
cask "network-radar"
# Handy utility to manage and customize the notch area
cask "notchnook"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calendar for professionals and teams
cask "notion-calendar"
# Replacement for Docker Desktop
cask "orbstack"
# Desktop virtualization software
cask "parallels"
# Remote desktop
cask "parsec"
# PDF reader, editor and annotator
cask "pdf-expert"
# VPN client
cask "private-internet-access"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Scientific and technical publishing system built on Pandoc
cask "quarto"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# IDE for embedded systems
cask "segger-embedded-studio-for-arm"
# Monitors the computer system and optimises its performance
cask "sensei"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Open source cross-platform file explorer
cask "spacedrive"
# Video game digital distribution service
cask "steam"
# Real time file synchronisation software
cask "syncthing"
# Quicklook extension for source files
cask "syntax-highlight"
# Mesh VPN based on WireGuard
cask "tailscale"
# Disposable email client
cask "tempbox"
# SSH client
cask "termius"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# OpenVPN client with AppleScript support
cask "viscosity"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Wine wrapper built with SwiftUI
cask "whisky"
# Scan, monitor, and troubleshoot wireless networks
cask "wifi-explorer"
# Network protocol analyzer
cask "wireshark"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "DaVinci Resolve", id: 571213070
mas "Developer", id: 640199958
mas "DuckDuckGo", id: 663592361
mas "Encrypto", id: 935235287
mas "Hand Mirror", id: 1502839586
mas "Keynote", id: 409183694
mas "Lunacy", id: 1582493835
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PastePal", id: 1503446680
mas "PDF Search", id: 1229271394
mas "Playlisty for Apple Music", id: 1459275972
mas "rcmd", id: 1596283165
mas "Shazam", id: 897118787
mas "Spark Desktop", id: 6445813049
mas "TestFlight", id: 899247664
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "affenwiesel.matlab-formatter"
vscode "alexcvzz.vscode-sqlite"
vscode "asciidoctor.asciidoctor-vscode"
vscode "astro-build.astro-vscode"
vscode "bluebrown.yamlfmt"
vscode "bramvanbilsen.matlab-code-run"
vscode "christian-kohler.npm-intellisense"
vscode "dan-c-underwood.arm"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "doublebuffer.metal-shader"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hmccsbw.hmmm"
vscode "james-yu.latex-workshop"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mathworks.language-matlab"
vscode "mechatroner.rainbow-csv"
vscode "mkvoya.eps-preview"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "mshr-h.veriloghdl"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "quarto.quarto"
vscode "raylabz.act"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "semanticdiff.semanticdiff"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shinyypig.matlab-in-vscode"
vscode "sswg.swift-lang"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tcwalther.cython"
vscode "tecosaur.latex-utilities"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "xaver.clang-format"
